ufanders/kennedy_9800/kennedy9800/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── CPU ───────────────────────────────────────────────────────────────────
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# ── PSRAM (OPI PSRAM on ESP32-S3-N16R8) ──────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

# ── Flash (16 MB Octal) ───────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_OIO=y

# ── USB: route console via USB-CDC so GPIO43/44 are free for read bus ─────
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_UART_NONE=y

# ── USB OTG / TinyUSB ─────────────────────────────────────────────────────
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_UNICORE=n

# ── IRAM: place ISR handlers and frequently-called paths in IRAM ──────────
CONFIG_ESP32S3_INSTRUCTION_CACHE_SIZE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_SIZE_64KB=y

# ── GPTimer ───────────────────────────────────────────────────────────────
CONFIG_GPTIMER_ISR_IRAM_SAFE=y

# ── GPIO ISR ─────────────────────────────────────────────────────────────
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=n

# ── Logging ───────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Heap ──────────────────────────────────────────────────────────────────
CONFIG_HEAP_POISONING_DISABLED=y
